{
  "total_reviews": 8,
  "collection_date": "2024-12-25T07:49:32.095Z",
  "reviews": [
    {
      "author": "K백검",
      "rating": 5,
      "text": "Great food and authentic taste! A very nice brunch/lunch experience and many visitors/locals. Spacious but is vibrant with crowds which is a great thing. Our server Mr. Omar helped us by recommending the food and often attending our table. He was nice and helpful. If you are visiting Citywalk, should pay a visit!",
      "date": "2 months ago"
    },
    {
      "author": "Omnia Esmat",
      "rating": 5,
      "text": "My experience at Allo Beirut was amazing in every way! The authentic Lebanese atmosphere was evident in every detail, from the decor to the soothing music. As for the food, it was truly exceptional—fresh and delicious, especially the grills and the tabbouleh. The service was also outstanding, and I want to particularly thank Mr. Jamil Kriter for his quick and professional service. He ensured our comfort throughout the visit. I’ll definitely be coming back soon and highly recommend it to everyone",
      "date": "4 days ago"
    },
    {
      "author": "Aveenash Tewari",
      "rating": 4,
      "text": "While the tantalizing aromas and vibrant atmosphere at Allo Beirut immediately set the stage for a delightful culinary experience, the service unfortunately fell short. The staggered arrival of dishes, with lengthy pauses between courses, disrupted the flow of the meal.\n\nWhile the service could use some refinement, the exceptional food and inviting outdoor atmosphere make it a worthwhile experience for those who are willing to exercise a little patience.",
      "date": "2 weeks ago"
    },
    {
      "author": "Sara Sanchez",
      "rating": 5,
      "text": "Beautiful and great location of this venue and perfectly connected with buses. The restaurant is beautiful inside and the service is great too! The food is outstanding ! Had the watermelon and feta salad that was delicious and a falafel that was delicious too! Highly recommend this restaurant for lunch or dinner, a great place to visit and enjoy alone or with friends!",
      "date": "a month ago"
    },
    {
      "author": "Moh'd Aldossary",
      "rating": 5,
      "text": "It is great place for eating, excellent staff and very clean place. I really enjoy eating there. Their staff are very friendly, I don’t recall all their names. But I really want to appreciate Mr. Sohaib for his excellent work at the reception and always ensure your order done in timely manner. Once again, thanks Allo Beirut and keep up the excellent work.",
      "date": "4 months ago"
    },
    {
      "author": "Yaser A",
      "rating": 4,
      "text": "Allo Beirut at City Walk is a great spot in the heart of Dubai for a unique take on Lebanese flavors. The staff here are fantastic, friendly, attentive, and quick with service. I ordered the healthy beef shawarma, and the taste was absolutely amazing! The beef was well-seasoned and flavorful, which made every bite enjoyable. However, since it’s a health-focused option, the shawarma served hot and bread  served cold, which may surprise some. Presentation could use a bit more flair, and no sides were offered, which might leave you wanting just a little extra.\n\nThe location at City Walk is perfect, offering an open, vibrant atmosphere that truly feels like you’re right in the middle of Dubai. The view is fantastic, adding a great ambiance to the experience. Plus, the restaurant is wheelchair accessible, making it convenient for all visitors.\n\nAllo Beirut offers a delicious meal and a great experience. With slight improvements in presentation, it could easily become a five-star spot!”",
      "date": "a month ago"
    },
    {
      "author": "Areeba Arshad",
      "rating": 4,
      "text": "The interior of the restaurant is well done. Very funky and fun. Suits the name. It is spacious and seating is comfortable. Very Kid friendly.\nThis time around the service was a-little slow but the staff was kind enough to make it up to us by giving our babies complementary fruit.\nWe ordered the hummus with pinenuts, mutabal, beef shawarma and mix grill platter. The food was delicious specially the shishtouk kabab. The only draw back is that standard bread served is cold. For hot bread you have to place an order or ask however it should always be served hot.",
      "date": "4 months ago"
    },
    {
      "author": "Ayyoub Elkehal",
      "rating": 1,
      "text": "Every time i order i receive my order different like seriously a shawarma with a size of my finger ? And a sniff of chicken no sauce no pickles nothing!!!! I’ve never had an order like this. Im a regular guest ordering online and dining sometimes. So i know the restaurant portions very well. Stopped ordering or going there to dine because this is hilarious and frustrating in same time !!! 😤👎",
      "date": "a month ago"
    }
  ]
}